<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"bd8b23117b0d280f589f6e1ffb2f8aa1309225d000b1ad4108f5523a78699366","plan_job_ref":"Job Terraform Plan #101 at https://github.com/cal-itp/data-infra/actions/runs/14480484083","plan_out_hash":"1ef581c01711c1d1280ead100c43efcec20fe9534ace7d9a00e98db7dcb8f835","plan_hash":"d602aa1f0e1e1323bd615032abcee849c6a4900b45782d9bff5ab6e27efccc94","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_custom_role.calitp-dds-analyst will be created
+   resource "google_project_iam_custom_role" "calitp-dds-analyst" {
+       deleted     = (known after apply)
+       description = "Custom role for DDS Analysts"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "viewer",
        ]
+       project     = "cal-itp-data-infra-staging"
+       role_id     = "***********"
+       stage       = "GA"
+       title       = "DDSAnalyst"
    }

  # google_project_iam_member.DOT_DDS_Data_Pipeline_and_Warehouse_Users will be created
+   resource "google_project_iam_member" "DOT_DDS_Data_Pipeline_and_Warehouse_Users" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "principalSet://iam.googleapis.com/locations/global/workforcePools/dot-ca-gov/group/DOT_DDS_Data_Pipeline_and_Warehouse_Users"
+       project = "cal-itp-data-infra"
+       role    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #101](https://github.com/cal-itp/data-infra/actions/runs/14480484083)